# Taps # 
tap "homebrew/bundle"
tap "nikitabobko/tap"

# CLI Tools # 
brew "neovim"
brew "tmux"
brew "fastfetch"

brew "gh"
brew "curl"
brew "tree"
brew "stow"
brew "ripgrep"
brew "figlet"

# Git/hub tools #
brew "gh"
brew "gitleaks"
brew "git-filter-repo"

# Language Support # 
brew "lua"
brew "python"

# C Development #  
brew "autoconf"
brew "autoconf-archive"
brew "automake"
brew "ccache"
brew "cmake"
brew "pkgconf"
brew "nasm"
brew "sdl2"
brew "utf8proc", args: ["HEAD"]

# Casks #
cask "aerospace"
casl "karabiner-elements"
cask "font-jetbrains-mono-nerd-font"
cask "ghostty"
cask "raycast"
cask "spotify"
cask "zen"
cask "docker"


