# Tap Repositories
tap "homebrew/bundle" # Manage Homebrew dependencies

# Core Utilities
brew "git" # Version control 
brew "htop" # Process viewer
brew "curl" # Data transfer tool
brew "fastfetch" # System info fetcher
brew "stow" # File Stower ??

# Developer
brew "neovim" # Text editor
brew "tmux" # Terminal multiplexer
brew "fzf" # Fuzzy finder
brew "tree" # Directory visualizer
brew "yarn" # JS package manager
brew "ripgrep" # Fast search tool
brew "figlet" # ASCII art generator
brew "tree-sitter" # Parser generator
brew "gh" # GitHub CLI
brew "gitleaks" # Accidental Secret Scanner

# C Development Tools
brew "autoconf" # Configuration tool
brew "autoconf-archive" # Autoconf macros
brew "automake" # Makefile generator
brew "ccache" # Compiler cache
brew "cmake" # Build system
brew "pkgconf" # Compiler/linker flags helper
brew "nasm" # Assembler for x86/x86_64

# Programming Languages
brew "lua" # Scripting language
brew "zig" # Systems programming language

# Casks
cask "aerospace" # Window Manager 
cask "raycast" # Spotlight alternative
cask "ghostty" # Terminal emulator
cask "spotify" # Music 
cask "ticktick" # To-Do manager
cask "zen-browser" # Web browser

# Fonts
cask "font-jetbrains-mono-nerd-font" # Coding font
